import streamlit as st
import plotly.express as px
from src.data_preparation import df
import pandas as pd
import seaborn as sns

# 1 график
st.header('Анализ спроса на аренду велосипедов')
st.dataframe(df)
st.caption("Аренда велосипедов в Washington D.C. Информация о Capital Bikeshare program.")

hourly_demand = (df.groupby(["hour", 'working_holiday'], as_index=False)["count"].mean())

rent_per_hour = px.line(hourly_demand,
                        x = 'hour',
                        y = 'count',
                        color = 'working_holiday',
                        markers=True,
                        labels={
                            "hour": "Час дня",
                            "count": "Среднее количество аренд",
                            "working_holiday": "Тип дня"
                        }
                        )

st.subheader("График 1: Среднее количество аренд по часам в выходные и рабочие дни")
st.text("Бизнес-вопрос: тличается ли использования велосипедов в рабочие и выходные дни?")
st.plotly_chart(rent_per_hour)
st.markdown("Ответ: **спрос отличается.**")
st.text("В выходные дни пик в районе 13 часов. В рабочие - два пика около 8 и 17 часов, когда люди предположительно уходят на работу или возвращаются с нее.")
st.text("По выходным велосипеды используют как дневной досуг, а в будни - скорее как способ передвижения между работой и домом.")

# 2 график
st.subheader("График 2: Связь погоды в разное время года и спрос на аренду")
st.text("Бизнес-вопрос: как влияют погодные условия в разное время года на аренду велосипедов?")

season_weather = df.groupby(['season_name', 'weather_full'], as_index=False)['count'].mean()
print(season_weather)
heatmap = season_weather.pivot(index="season_name",
    columns='weather_full',
    values="count")

fig = px.imshow(heatmap, color_continuous_scale="YlOrRd", labels={
                            "x": "Погодные условия",
    "y": "Время года",
    "color": "Среднее количество аренд"
                        })
st.plotly_chart(fig)
st.markdown('Ответ: **влияние погодных условий не одинаково по всем сезонам**.')
st.markdown("- Весной, летом и осенью наибольший спрос в ясную погоду, тогда как зимой люди охотнее арендуют велосипеды в сильный дождь или снег")
st.markdown("- Наибольший спрос на аренду велосипедов **летом**, причем небольшая облачность почти не снижает спрос")
st.markdown("- Спрос на велосипеды зимой наименьший. Тем не менее, как уже было замечено, **силыный дождь или снег влияет на повышение спроса зимой**")
st.markdown("- Следует заметить, что оценка погодный условий  'Сильный дождь или снег' затрудяется особенностями климата в Washington D.C. Там влажный субтропический климат, который характеризуется жарким летом, теплыми и комфортными осенью и весной и холодной зимой. Это означает, что **оценить в полной мере спрос во время Сильного снега или дождя невозможно**, ведь такая погода в основном присуща земнему периоду")

# 3 график
st.subheader("График 3: Зарегистрированные и незарегистрированные пользователи")
st.text("Бизнес-вопрос: Как меняется поведение зарегистрированных и незарегистрированных пользователей в зависимости от внеших условий? Различается ли оно?")

features = {'Рабочий день или выходные?': 'working_holiday',
            'Погода': 'weather_full',
            'Температура': 'temp',
            'Влажность': 'humidity',
            'Скорость ветра': 'windspeed',
            'Время года': 'season_name'}

x_axis = st.selectbox('Выберете значение для x:', list(features.keys()), index=0)
selected_column = features[x_axis]

df_fig3 = df.copy()

if selected_column == 'temp':
    df_fig3['x'] = pd.cut(
        df_fig3["temp"],
        bins=[-float("inf"), 10, 20, 30, float("inf")],
        labels=["Ниже 10°C", "10–20°C", "20–30°C", "Выше 30°C"]
    )

elif selected_column == 'humidity':
    df_fig3['x'] = pd.cut(
        df_fig3['humidity'],
        bins=[-1, 40, 70, 100],
        labels=['Низкая влажность', "Умеренная влажость", "Высокая влажность"]
    )

elif selected_column == 'windspeed':
    df_fig3['x'] = pd.cut(
        df_fig3['windspeed'],
        bins=[-1, 8, 20, 40, 58, 110, float("inf")],
        labels=["Штиль или легкий ветер",  "Слабый ветер", "Умеренный ветер",  "Сильный ветер", "Очень сильный ветер", "Ураган"]
    )

else:
    df_fig3['x'] = df_fig3[selected_column].astype(str)

grouped_df3 = (df_fig3.groupby("x", observed=True)[['Незарегистрированный пользователь', 'Зарегистрированный пользователь']].mean().reset_index())

plot_df = grouped_df3.melt(
    id_vars="x",
    value_vars=['Незарегистрированный пользователь', 'Зарегистрированный пользователь'],
    var_name="User Type",
    value_name="count"
)

fig3 = px.bar(plot_df, 'x', 'count',  color="User Type",
    barmode='group',
    title=f'Среднее количество аренд в зависимости от условия {x_axis}',
    labels={
        'x': x_axis,
        'count':  'Количиство аренд',
        'User Type': 'Тип пользователя'
    })

st.plotly_chart(fig3)
st.markdown(" - Зарегистрированные пользователи в целом чаще пользуются услугами аренды велосипедов при любых погодных условиях. Возможно, **стоит сделать упор на привлечение пользователей в систему лояльности.**")
st.markdown(" - **Незарегистированные пользователи более чувствительны к изменению погоды**. Так, пока зарегистрированные пользователи в среднем одинаково часто берут веслосипеды и в ясную погоду, и в сильный дождь, **спрос со стороны незарегистированных пользователей в 4 раза меньше при сильном дожде, чем в случае хорошей погоды**")
st.markdown("- **Незарегистированные пользователи чаще берут велосипеды в выходные дни**, тогда как **зарегистрированные - в будни**")
st.markdown("- **С ростом температуры** обе группы пользователей становятся более заинтересованы в велосипедах")
st.markdown("- Сила ветра существенно не влияет на обе группы, но все предпочитают брать велосипеды во время **слабого или умеренного ветра**")

# 4 график

st.subheader("График 4: Корреляция признаков")
st.markdown("Бизнес вопрос: какие признаки все-таки наиболее коррелируют с арендой велосипедов?")
corr_columns = [
    "temp",
    "atemp",
    "humidity",
    "windspeed",
    "casual",
    "registered",
    "count"
]

corr_matrix = df[corr_columns].corr(method='pearson')

corr_matrix = corr_matrix.rename(columns={
    "temp": "Температура",
    "atemp": "Температура: ощущается как",
    "humidity": "Влажность",
    "windspeed": "Скорость ветра",
    "casual": "Незарегистрированные пользователи",
    "registered": "Зарегистрированные пользователи",
    "count": "Количество аренд"
}, index={
    "temp": "Температура",
    "atemp": "Температура: ощущается как",
    "humidity": "Влажность",
    "windspeed": "Скорость ветра",
    "casual": "Незарегистрированные пользователи",
    "registered": "Зарегистрированные пользователи",
    "count": "Количество аренд"
})

fig4 = px.imshow(corr_matrix, color_continuous_scale='Purp')
st.plotly_chart(fig4)
st.markdown("- **Количество аренд** больше всего коррелирует с **регистрацией пользователя** (коэффицент = 0.9). Однако эта связь отчасти обусловлена тем, что зарегистрированные пользователи являются компонентом общего количества аренд.")
st.markdown("- Количество аренд негативно коррелирует с влажностью, то есть **меньшая влажность связана с большей арендой**  (коэффицент = -0.31)")
st.markdown("- Между арендой велосипедов и скорость ветра связь очень слабая (коэффицент =  0.1)")
st.markdown("В целом, **наибольшая связь выявлена между регистрацией пользователя и арендой велосипеда, тогда как корреляция с погодными и температурными условиями не так видна**.")

st.subheader("Итоговые выводы и Бизнес-рекомендации")
st.markdown("""
В ходе анализа данных об аренде велосипедов Capital Bikeshare в Washington D.C. были выявлены следующие закономерности:

1. Поведение пользователей зависит от типа дня.

В рабочие дни наблюдаются два выраженных пика спроса: утром и вечером, - что может свидетельствовать об использовании велосипедов для поездок на работу и обратно. В выходные спрос достигает максимума в дневные часы. Таким образом, в будни велосипеды используются в качестве транспорта, а в выходные в качестве досуга. Это может помочь в понимании позиционироании продукта. 

2. Погодные условия связаны с уровнем спроса.

Наибольший спрос наблюдается при благоприятных погодных условиях. Зимой общий уровень спроса существенно ниже, при этом наблюдается интерес в сильный дождь или снег. Эти ррезультаты следует интерпретировать осторожно из-за возможного недостатка наблюдений.

3. Зарегистрированные и незарегистрированные пользователи демонстрируют разные модели поведения.

Зарегистрированные пользователи обеспечивают большую часть аренд и демонстрируют более устойчивый спрос. Незарегистрированные пользователи сильнее реагируют на изменение погодных условий и чаще используют велосипеды в выходные дни. 

4. Температура и влажность связаны со спросом сильнее, чем скорость ветра.

**Бизнес-рекомендации**

На основании выявленных закономерностей можно предложить несколько направлений для развития сервиса:
- Удержание зарегистрированных пользователей: развивать программы лояльности и стимулировать регулярное использование сервиса.
- Привлечение новых пользователей: запускать акции и специальные предложения в выходные дни, когда спрос со стороны незарегистрированных пользователей выше.
- Погодно-зависимое продвижение: использовать благоприятный прогноз погоды для запуска рекламных кампаний и стимулирования аренды.
- Планирование доступности велосипедов: учитывать различия в почасовом спросе между рабочими и выходными днями, а также сезонные колебания при распределении велосипедов.

Таким образом, спрос на аренду велосипедов связан не только с погодными условиями, но и с типом дня, сезоном и характеристиками пользовательских сегментов. Учет этих факторов может помочь сервису эффективнее планировать доступность велосипедов и маркетинговые активности.
            """)